"""
กฤษฎาจำเป็นต้องเดินทางไกลเข้าไปในป่าเนื่องจากเป็นหลักสูตรของลูกเสือสามัญ  
แต่กฤษฎาได้หลงทางเข้ามาในป่าลึก หลังจากเดินไปสักพักกฤษฎาก็ได้สังเกตเห็นเลขบนต้นไม้แต่ละต้น 
ซึ่งเป็นตัวเลขที่แสดงความสูงของต้นไม้แต่ละต้น (มีหน่วยเป็นเมตร) 
กฤษฎาจึงคิดอะไรสนุกๆทำเพื่อแก้เบื่อโดยการเดินไปเรื่อยๆ และจำความสูงของต้นไม้แต่ละต้น 
และจะหันกลับมามอง ต้นไม้ที่เคยเดินผ่านไป

เขียนโปรแกรมเพื่อรับความสูงของต้นไม้ที่กฤาฎาได้เดินผ่าน  แล้วหาว่าเมื่อกฤษฎาหันหลังกลับมามองจะเห็นต้นไม้กี่ต้น

อธิบาย Input :   A  <Heights>  ความสูงของต้นไม้,   B  คือการหันมามอง

อธิบาย Test Case : กฤษฎาจะเดินผ่านต้นไม้ความสูง 4 ก่อนแล้วตามด้วย 3 แล้วหันหลังกลับมามองจะเห็นต้นไม้ 2 ต้น 
                  ต่อมาเดินไปเจอต้นไม้สูง  5  กับ ต้นไม้สูง 8 ตามลำดับ  แล้วหันหลังกลับมามองจะเห็นแค่ต้นไม้ต้นเดียว  
                  เนื่องจากต้น 8 เมตรบังต้นไม้ความสูง  4  3  และ  5 

โดยจะรับประกันว่าจะมีต้นไม้อย่างน้อย 1 ต้นและมีการหันกลับมาอย่างน้อย 1 ครั้ง


Enter Input : A 4,A 3,B,A 5,A 8,B
2
1

"""
class Stack():
    def __init__(self):
        self.items = []
        pass

    def push(self, i):
        self.items.append(i)

    def pop(self):
        return self.items.pop()

    def isEmpty(self):
        return self.items == []
    
    def size(self):
        return len(self.items)


x = input("Enter Input : ").split(",")
y = []
new_x = []
for i in x:
    y = i.split()
    new_x.extend(y)

s = Stack()

for i in range(len(new_x)):
    if new_x[i] == 'A':
        s.push(int(new_x[i+1]))
print(s.items)